УправлениеРассылками/src/InformationRegisters/ПротоколОтправки/ПротоколОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколОтправки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИВремяОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.Рассылка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресЭПКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеРассылками/src/Enums/ДопСтатусыРассылки/ДопСтатусыРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДопСтатусыРассылки</name>
  <enumValues>
    <name>Отписка</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>НеверныйАдрес</name>
  </enumValues>
</mdclass:Enum>

УправлениеРассылками/src/Catalogs/УчётныеЗаписиЭП/УчётныеЗаписиЭП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчётныеЗаписиЭП</name>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортIMAP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеРассылками/src/CommonModules/РезультатыРассылки/Module.bsl
&НаСервере
Процедура ОбработатьОшибкиИОтказыНаСервере() Экспорт
	
	УчЗапись = Справочники.УчётныеЗаписиЭП.Выбрать();
	
	Пока УчЗапись.Следующий() Цикл
		Сообщить(УчЗапись.АдресЭП);
		Профиль = ПолучитьПрофиль(УчЗапись);
		Почта = ПодключитьсяКПочте(Профиль);
		
		МассивСообщений = новый Массив;
		МассивСообщений = Почта.Выбрать(Ложь);
		Для Индекс=0 по МассивСообщений.Количество() - 1 Цикл
		
			Сообщение = МассивСообщений[Индекс];
			Тема = Сообщение.Тема;
			Отправитель = Сообщение.Отправитель.Адрес;

			Если (СтрНайти(НРег(Тема), "отпис")) Тогда
				НаборЗаписей = РегистрыСведений.ПротоколОтправки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.АдресЭПКонтрагента.Установить(Отправитель);
				НаборЗаписей.Прочитать();
				Запись = НаборЗаписей[НаборЗаписей.Количество()-1];
				Запись.ДопРезультат=Перечисления.ДопСтатусыРассылки.Отписка;
				НаборЗаписей.Записать();
				СоздатьЗадачуПоТеме(Запись, "Удалить контрагента из сегмента");
				
			Иначе Если (СтрНайти(НРег(Отправитель), "mailer-daemon")) Тогда

				Тексты = Сообщение.Тексты;
				СодержимоеСообщения = "";
				Для каждого ТесктСообщения из Тексты Цикл
					СодержимоеСообщения = СодержимоеСообщения + ТесктСообщения.Текст;
				КонецЦикла;
				Шаблон = "(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|""(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])*"")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\[(?:(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9]))\.){3}(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9])|[a-z0-9-]*[a-z0-9]:(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)\])";
				АдресЭП = НайтиПодстроки(Шаблон, СодержимоеСообщения);
				НаборЗаписей = РегистрыСведений.ПротоколОтправки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.АдресЭПКонтрагента.Установить(АдресЭП);
				НаборЗаписей.Прочитать();
				Запись = НаборЗаписей[НаборЗаписей.Количество()-1];
				Запись.ДопРезультат=Перечисления.ДопСтатусыРассылки.НеверныйАдрес;
				НаборЗаписей.Записать();
				СоздатьЗадачуПоТеме(Запись, "Уточнить контактную информацию");
			КонецЕсли;
			КонецЕсли;
			
	КонецЦикла;
		
		
		ОтключитьсяОтПочты(Почта);
		Сообщить("Отключились от почты");
	КонецЦикла;
	
	
КонецПроцедуры


Функция ПодключитьсяКПочте(Профиль)	
	Почта = Новый ИнтернетПочта;
	Попытка
	Почта.Подключиться(Профиль);
	Сообщить("Подключение к профилю прошло успешно");
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат 0;
	КонецПопытки;
	Возврат Почта;
КонецФункции

Процедура ОтключитьсяОтПочты(Почта)
	Почта.Отключиться(); 
	Сообщить("Отключение от почты");
КонецПроцедуры


Функция ПолучитьПрофиль(УчЗапись)
Профиль = Новый ИнтернетПочтовыйПрофиль;
Профиль.АдресСервераSMTP = УчЗапись.СерверSMTP;
Профиль.ПортSMTP = УчЗапись.ПортSMTP;
Профиль.ИспользоватьSSLSMTP = Истина;
Профиль.Пользователь = УчЗапись.АдресЭП;
Профиль.Пароль = УчЗапись.Пароль;
Профиль.ПользовательSMTP = УчЗапись.АдресЭП;
Профиль.ПарольSMTP = УчЗапись.Пароль;
Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;

Профиль.АдресСервераIMAP = УчЗапись.СерверIMAP;
Профиль.ПортIMAP = УчЗапись.ПортIMAP;
Профиль.ИспользоватьSSLIMAP = Истина;
Профиль.ТолькоЗащищеннаяАутентификацияIMAP = Ложь;
Профиль.ПользовательIMAP = УчЗапись.АдресЭП;
Профиль.ПарольIMAP = УчЗапись.Пароль;

Профиль.АдресСервераPOP3 = УчЗапись.СерверPOP3;
Профиль.ПортPOP3 = УчЗапись.ПортPOP3;
Профиль.ИспользоватьSSLPOP3 = Истина;
Профиль.ТолькоЗащищеннаяАутентификацияPOP3 = Ложь;

Профиль.ВремяОжидания = 50; 

Возврат Профиль;
КонецФункции


Функция НайтиПодстроки(Шаблон, Текст)

	RegExp = Новый COMОбъект("VBScript.RegExp");
	
	//Поиск всех вхождений шаблона	
	RegExp.Global = Ложь;	

	//Игнорировать регистр символов
	RegExp.IgnoreCase = Истина; 
	
	//Многострочный режим	
	RegExp.MultiLine = Истина; 
	RegExp.Pattern = Шаблон;
	Matches = RegExp.Execute(Текст);
	МассивЗначений = Новый Массив();
	
	Для каждого StrMatches Из Matches Цикл		
		МассивЗначений.Добавить(StrMatches.Value);		
	КонецЦикла;
	
	Возврат МассивЗначений[0];
	
КонецФункции 

Процедура СоздатьЗадачуПоТеме(Запись, Тема)
	Задача = Задачи.ЗадачаОбработкаОшибокОтказов.СоздатьЗадачу();
	Задача.Рассылка = Запись.Рассылка;
	Задача.Контрагент = Запись.Контрагент;
	Задача.СегментКонтрагентов = Запись.Рассылка.Получатели;
	Задача.Наименование = Тема;
	Задача.Дата = Дата(ТекущаяДата());
	Задача.Записать();
КонецПроцедуры
